USE [KB301_Kolmogortsev]
GO

INSERT INTO [Auto].[Post] VALUES
	(1, N'Север'),
	(2, N'Юг'),
	(3, N'Запад'),
	(4, N'Восток'),
	(5, N'Юго-запад');
GO

INSERT INTO [Auto].[PolicePost] VALUES
	(N'А345ВУ12', '174', 12:45:06, 'въезд', 1)
	(N'А345ВУ12', '74', 12:45:06, 'выезд', 1)
	(N'А345ВУ12', '174', 12:45:06, 'въезд', 1)
	(N'А345ВУ12', '174', 12:45:06, 'въезд', 1)



--Эти условия должны отслеживаться ключами, триггерами и ограничениями check. Все типы ограничений должны использоваться.
--В скрипте иметь тест на проверку корректной работы ограничений.
