USE [KB301_Kolmogortsev]
GO


INSERT INTO [Kolmogortsev].[productGroup] 
VALUES 
	(1, N'Хлебобулочные изделия'),
	(2, N'Молочные'),
	(3, N'Рыба'),
	(4, N'Мясо'),
	(5, N'Вода'),
	(6, N'Фрукты'),
	(7, N'Замороженные продукты'),
	(8, N'Кондитерские');

INSERT INTO [Kolmogortsev].[product] 
VALUES 
	(1, 8, N'Конфеты', N'шт'),
	(2, 7, N'Пельмени', N'г'),
	(3, 1, N'Хлеб', N'г'),
	(4, 3, N'Минтай', N'кг'),
	(5, 4, N'Свинина', N'кг'),
	(6, 5, N'Ессентуки', N'л'),
	(7, 5, N'Боржоми', N'л'),
	(8, 3, N'Горбуша', N'кг'),
	(9, 7, N'Замороженные овощи', N'г'),
	(10, 1, N'Булочка', N'г'),
	(11, 2, N'Сыр', N'г'),
	(12, 2, N'Молоко', N'л'),
	(13, 6, N'Яблоки', N'кг'),
	(14, 6, N'Груши', N'кг'),
	(15, 6, N'Сливы', N'кг'),
	(16, 2, N'Творог', N'л'),
	(17, 1, N'Батон', N'г'),
	(18, 7, N'Замороженные котлеты', N'г');
	

INSERT INTO [Kolmogortsev].[shop]
VALUES 
	(1, N'Пятёрочка', N'Красноармейская', '1'),
	(2, N'Монетка', N'Ленина', '19'),
	(3, N'Верный', N'Шварца', '90'),
	(4, N'Магнит', N'Мамина-Сибирика', '75/15'),
	(5, N'Кировский', N'Свердлова', '16'),
	(6, N'Ермолино', NULL, '24'),
	(7, N'Пятёрочка', N'Фрунзе', '78');


INSERT INTO [Kolmogortsev].[storage] 
VALUES
	(1, 1, 86.7, 25, '01.05.2022', '+'),
	(2, 2, 60, 30.9, '22.05.2022', '-'),
	(3, 3, 78.97, 110, '22.05.2022', '-'),
	(4, 4, 45, 117, '18.05.2022', '+'),
	(5, 5, 32, 66, '15.05.2022', '+'),
	(6, 6, 20, 650, '23.05.2022', '+'),
	(1, 7, 88, 105, '22.05.2022', '-'),
	(2, 8, 60.4, 230, '22.05.2022', '+'),
	(3, 9, 55, 25, '21.05.2022', '+'),
	(4, 10, 40, 21, '02.05.2022', '-'),
	(5, 11, 21, 420, '04.05.2022', '-'),
	(6, 12, 56, 65.5, '11.05.2022', '+'),
	(1, 13, 84, 80, '10.05.2022', '+'),
	(2, 14, 100, 27, '16.05.2022', '-'),
	(3, 15, 5, 275, '18.05.2022', '+'),
	(4, 16, 32, 35, '20.05.2022', '-'),
	(5, 17, 87, 499.99, '20.05.2022', '+'),
	(6, 18, 140, 254, '22.05.2022', '-'),
	(1, 1, 90, 56, '22.05.2022', '+'),
	(1, 2, 120, 64, '21.05.2022', '-'),
	(4, 2, 80, 65, '17.05.2022', '+'),
	(5, 2, 45, 72, '18.05.2022', '+'),
	(4, 12, 60, 69.98, '16.05.2022', '+'),
	(1, 12, 52, 50, '11.05.2022', '-'),
	(2, 12, 56, 55, '11.05.2022', '+'),
	(7, 12, 56, 100, '11.05.2022', '+'),
	(7, 4, 56, 100, '21.05.2022', '+'),
	(6, 4, 56, 100, '21.05.2022', '-');